#include <stdio.h>
// 打印整型数组
void print(int array[],int len ){  //数组在传递时不能传递元素的个数,只会将数组的起始地址传过去   在此处传递数组的长度或多小没有作用 应直接声明一个空数组 
    int i;
    for (i = 0; i < len ;i++){
        printf("a[%d]=%-3d",i,array[i]);
    }
    array[9] = 20;   //函数内部也能更改数组的值
    printf("\na");
}

//打印字符数组
void print1(char c[]){
    int i = 0;
    while (c[i])    //判断条件可为 !='\0' !=0 或者直接 c[i]
    {
        printf("%c", c[i]);
        i++;
    }
    printf("\n");
    c[0] = c[0] - 32;
}
int main()
{
/* //array  类型 变量名[元素个数]
//int a[10];   //int类型的数组  变量名为a 它有10个元素
int a[10]={1, 3, 5, 6, 7};   //可以只赋值一部分  没有赋值的元素默认为0
int b[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0};   
int c[10] = {0};  //赋值全为0
int d[] = {1, 2, 3, 4};  //也可以不指定数组长度 */

// int j=10;
// int a[5] = {1, 2, 3, 4, 5};
// int i=3;
// // a[5] = 20;   //访问越界(访问了不属于自己的空间)   访问越界会造成数据异常
// // printf("%d\n",j);


// int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
// print(a, sizeof(a) / sizeof(a[0]));
// printf("a[9]=%d\n",a[9]);


/* //字符数组
//可以使用以下两种方式初始化字符数组
char c[10] = {'I', 'a', 'm', 'h', 'a', 'p', 'p', 'y'};   //使用字符数组是时数组大小必须为字符长度+1,因为还会在末尾存一个'\0' (c语言字符串的结束标识符为 '\0' )
char c1[5] = "hello";   //这种赋值会自动添加  '\0'
printf("%s----%s\n",c,c1);
//%s 输出的是字符数组或者字符串常量 */

/* char e[20] ,f[20];
// 此处没有使用取地址 是因为数组名本身存储的就是数组的起始地址 
//此方法读取字符串中不会含有空格 因为%s遇到空格或者换行时后自动匹配结束 并忽略空格或换行继续匹配下一个
scanf("%s%s", e,f);   //输入完成后会自动添加 '\0'   %s 会自动忽略空格与换行   如'hello'是占6个字节(还有'\0')
printf("%s------%s\n",e,f); */


//字符数组的传递

char c[10] = "hello";
print1(c);
print1(c);
return 0;
}